onemoney-service/src/main/resources/example/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:api="http://cps.huawei.com/cpsinterface/api_requestmgr"
                  xmlns:req="http://cps.huawei.com/cpsinterface/request"
                  xmlns:com="http://cps.huawei.com/cpsinterface/common">
    <soapenv:Header/>
    <soapenv:Body>
        <api:Request>
            <req:Header>
                <req:Version>1.0</req:Version>
                <req:CommandID>InitTrans_2304</req:CommandID>
                <req:OriginatorConversationID>S_X2013012921006</req:OriginatorConversationID>
                <req:Caller>
                    <req:CallerType>2</req:CallerType>
                    <req:ThirdPartyID>GetBucks</req:ThirdPartyID>
                    <req:Password>/6yIcHWTIJqz8L0ldEI9fg==</req:Password>
                    <req:ResultURL>http://10.245.1.44:7001/mockAPIResultMgrBinding</req:ResultURL>
                </req:Caller>
                <req:KeyOwner>1</req:KeyOwner>
                <req:Timestamp>20130402152345</req:Timestamp>
            </req:Header>
            <req:Body>
                <req:Identity>
                    <req:Initiator>
                        <req:IdentifierType>11</req:IdentifierType>
                        <req:Identifier>haraka</req:Identifier>
                        <req:SecurityCredential>REPLACE WITH ENCRYPTED PASSWORD</req:SecurityCredential>
                        <req:ShortCode>009644</req:ShortCode>
                    </req:Initiator>
                    <req:ReceiverParty>
                        <req:IdentifierType>1</req:IdentifierType>
                        <req:Identifier>263712980331</req:Identifier>
                    </req:ReceiverParty>
                </req:Identity>
                <req:TransactionRequest>
                    <req:Parameters>
                        <req:Amount>1.00</req:Amount>
                        <req:Currency>USD</req:Currency>
                        <req:ReasonType>IndividualB2CPayment_VDF_Demo</req:ReasonType>
                    </req:Parameters>
                </req:TransactionRequest>
                <req:ReferenceData>
                    <req:ReferenceItem>
                        <com:Key>POSDeviceID</com:Key>
                        <com:Value>GETBUCKS</com:Value>
                    </req:ReferenceItem>
                </req:ReferenceData>
                <req:Remark>YOUR REFERENCE INFORMATION</req:Remark>
            </req:Body>
        </api:Request>
    </soapenv:Body>
</soapenv:Envelope>