request.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:api="http://cps.huawei.com/cpsinterface/api_requestmgr"
	xmlns:req="http://cps.huawei.com/cpsinterface/request"
	xmlns:com="http://cps.huawei.com/cpsinterface/common">
	<soapenv:Header/>
	<soapenv:Body>
		<api:Request>
			<req:Header>
				<req:Version>1.0</req:Version>
				<req:CommandID>InitTrans_TwoPartPayment</req:CommandID>
				<req:OriginatorConversationID>S_X20130129217458</req:OriginatorConversationID>
				<req:Caller>
					<req:CallerType>2</req:CallerType>
					<req:ThirdPartyID>APP_Caller</req:ThirdPartyID>
					<req:Password>gMMqGGrKxsE=</req:Password>
					<req:ResultURL>http://10.245.1.44:7001/mockAPIResultMgrBinding</req:ResultURL>
				</req:Caller>
				<req:KeyOwner>1</req:KeyOwner>
				<req:Timestamp>20130402152347</req:Timestamp>
			</req:Header>
			<req:Body>
				<req:Identity>
					<req:Initiator>
						<req:IdentifierType>1</req:IdentifierType>
						<req:Identifier>263712980331</req:Identifier>
					</req:Initiator>
					<req:ReceiverParty>
						<req:IdentifierType>4</req:IdentifierType>
						<req:Identifier>36644</req:Identifier>
					</req:ReceiverParty>
				</req:Identity>
				<req:TransactionRequest>
					<req:Parameters>
						<req:Amount>1.48</req:Amount>
						<req:Currency>USD</req:Currency>
					</req:Parameters>
				</req:TransactionRequest>
			</req:Body>
		</api:Request>
	</soapenv:Body>
</soapenv:Envelope>