src/xmls/activate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:api="http://cps.huawei.com/cpsinterface/api_requestmgr" xmlns:req="http://cps.huawei.com/cpsinterface/request" xmlns:com="http://cps.huawei.com/cpsinterface/common">
  <soapenv:Header/>
  <soapenv:Body>
    <api:Request>
      <req:Header>
        <req:Version>1.0</req:Version>
        <req:CommandID>ActivateCustomerDirectDebitMandate</req:CommandID>
        <req:OriginatorConversationID>S_X2013012921001</req:OriginatorConversationID>
        <req:ConversationID>AG_20130129T102103</req:ConversationID>
        <req:Caller>
          <req:CallerType>2</req:CallerType>
          <req:ThirdPartyID>POS_Broker</req:ThirdPartyID>
          <req:Password>B1YNY8GylVo=</req:Password>
          <req:ResultURL>http://10.71.109.150:8888/mockResultBinding</req:ResultURL>
        </req:Caller>
        <req:KeyOwner>1</req:KeyOwner>
        <req:Timestamp>20130402152345</req:Timestamp>
      </req:Header>
      <req:Body>
        <req:Identity>
          <req:Initiator>
            <req:IdentifierType>14</req:IdentifierType>
            <req:Identifier>AAA</req:Identifier>
            <req:SecurityCredential>kMhIAmNE4h8=</req:SecurityCredential>
           </req:Initiator>
          <req:ReceiverParty>
            <req:IdentifierType>1</req:IdentifierType>
            <req:Identifier>86812530001</req:Identifier>
          </req:ReceiverParty>
        </req:Identity>
        <req:ActivateDirectDebitMandateRequest>
          <req:MandateID>10101</req:MandateID>
          <req:AgreedTC>1</req:AgreedTC>
          <req:PayerAccountName>PayerAccount</req:PayerAccountName>
        </req:ActivateDirectDebitMandateRequest>
      </req:Body>
    </api:Request>
  </soapenv:Body>
</soapenv:Envelope>
